{"version":"1.0","identifier":"https://www.thespruce.com/best-drill-presses-4153445","title":"The 7 Best Drill Presses of 2021","language":"en","layout":{"columns":7,"gutter":40,"margin":70,"width":1024},"subtitle":"Get more at .","metadata":{"excerpt":"A good drill press is powerful, easy to control, and durable. We researched the features of the best models so you can pick the right ones for your projects.","thumbnailURL":"https://www.thespruce.com/thmb/trJ5F48aBRwG7M-AlNnLRGfLgCY=/759x1500/715RIGooSGL._SL1500_-59ea5516845b340011e4144c.jpg"},"documentStyle":{"backgroundColor":"#f6f6f6"},"components":[{"layout":"titleLayout","role":"title","text":"The 7 Best Drill Presses of 2021","textStyle":"titleStyle"},{"layout":"introLayout","role":"intro","text":"A good drill press is powerful, easy to control, and durable. We researched the features of the best models so you can pick the right ones for your projects.","textStyle":"introStyle"},{"layout":"headerImageLayout","role":"header","style":{"fill":{"URL":"https://www.thespruce.com/thmb/trJ5F48aBRwG7M-AlNnLRGfLgCY=/759x1500/715RIGooSGL._SL1500_-59ea5516845b340011e4144c.jpg","fillMode":"cover","type":"image","verticalAlignment":"center"}}},{"layout":"authorLayout","role":"author","text":"Michelle Ullman","textStyle":"authorStyle"},{"role":"body","text":"Drill presses are stationary tools–some stand on the floor while others sit on a workbench–with a sturdy and adjustable platform to hold the object being drilled, and an overhead chuck that holds the drill bit in place. Like a portable handheld drill, a drill press is a tool for making holes in wood or other hard materials, but drill presses go far beyond handheld drills in terms of power and precision.","layout":"bodyLayout","textStyle":"bodyStyle","format":"html"},{"role":"body","text":"A handheld drill is sufficient if you merely need to occasionally drill holes into wood for simple repairs or construction. But for drilling into very hard wood or metal, drilling through thick pieces of wood, producing large holes, drilling <a href=\"https://www.thespruce.com/how-to-drill-at-an-angle-1822332\" data-component=\"link\" data-source=\"inlineLink\" data-type=\"internalLink\" data-ordinal=\"1\" rel=\"noopener noreferrer\">at an angle</a>, or achieving the utmost in accuracy, a drill press is the tool of choice. We researched the top drill presses available today, and then whittled down the choices to those we feel are best in their categories.","layout":"bodyLayout","textStyle":"bodyStyle","format":"html"},{"role":"body","text":"Here are the best drill presses on the market.","layout":"bodyLayout","textStyle":"bodyStyle","format":"html"},{"role":"body","text":"It is all too easy to find the wrong drill press for your needs while shopping. Plenty of options promise the power you need for most construction projects but fail to deliver when needed. The WEN 12-Inch Variable Press, with a 12-inch swing and 3-1/8-inch stroke distance, is designed to skip the overselling and simply offers a powerful, <a href=\"https://www.thesprucecrafts.com/how-to-align-your-drill-press-3537091\" data-component=\"link\" data-source=\"inlineLink\" data-type=\"externalLink\" data-ordinal=\"1\" rel=\"noopener noreferrer nofollow\">straightforward drill press</a> for your shop. With a maximum speed of 3,200 rpm and variable speed dial, the power and control this top choice press offers ​is clear.","layout":"bodyLayout","textStyle":"bodyStyle","format":"html"},{"role":"body","text":"The benefit of a variable speed dial is you can change the speed while maintaining the same power and torque you may need for denser materials. Using high-quality bearings and a rigid frame, the body of this drill press will resist heavy abuse while extending the life of the inner workings of the power tool. If you need a drill press you can count on to work time and time again, this option is hard to beat.","layout":"bodyLayout","textStyle":"bodyStyle","format":"html"},{"role":"body","text":"If you just want a drill press for precision work on small items such as jewelry, shells, wood trim, or model making, there’s no need for a large tool that will take up lots of space and provide more muscle than you need. Instead, consider the Eurotool DRL-300.00 Small Benchtop Drill Press.","layout":"bodyLayout","textStyle":"bodyStyle","format":"html"},{"role":"body","text":"With a platform measuring a mere 6.75 inches x 6.75 inches, and an overall size of 10 x 12 x 8 inches, the drill press easily fits into any <a href=\"https://www.thespruce.com/workshop-storage-ideas-5079571\" data-component=\"link\" data-source=\"inlineLink\" data-type=\"internalLink\" data-ordinal=\"1\" rel=\"noopener noreferrer\">workspace</a>. But while it may be small, it’s not without power, although it’s certainly not designed for tackling the toughest drilling jobs.","layout":"bodyLayout","textStyle":"bodyStyle","format":"html"},{"role":"body","text":"The 110-volt motor achieves a top speed of 8,500 rpm, and there are three speed settings to choose from. The <strong>¼</strong>-inch Jacobs chuck accepts bits up to 6.5 mm.","layout":"bodyLayout","textStyle":"bodyStyle","format":"html"},{"role":"body","text":"Not a true drill press, but rather, a workstation that allows you to use your Dremel rotary tool in a similar manner to a drill press, this workstation/drill press fits into the category of “small but mighty,” and is perfect for delicate tasks such as crafts, jewelry, or work on electronics. Your rotary tool fits into the workstation, allowing you to angle the tool at a variety of angles for your needs.","layout":"bodyLayout","textStyle":"bodyStyle","format":"html"},{"role":"body","text":"The workstation screws into a worktable for stability without taking up too much valuable space. Note, however, that it does not include the Dremel rotary tool; you'll need to purchase that separately if you don't already own one.","layout":"bodyLayout","textStyle":"bodyStyle","format":"html"},{"role":"body","text":"For the price, you actually get one of the most flexible drill presses available. The flex shaft attachment works with the drill to allow you to rotate the head for angled holes up to 90 degrees horizontal. A tool holder and router mount extend the capabilities of this press, enabling other work such as plunge routing and sanding/grinding to be done all in one workstation.","layout":"bodyLayout","textStyle":"bodyStyle","format":"html"},{"role":"body","text":"If you don’t mind giving up some performance and control out of a drill press, the WEN 4208 is a reasonably priced alternative that won’t break the bank. The press sacrifices the more flexible variable control dial for a five speed switch that extends all the way to 3,140 rpm. The 1/3-horsepower motor will get the job done on small to medium jobs and common construction materials, including <a href=\"https://www.thespruce.com/janka-wood-flooring-hardness-rating-chart-1821655\" data-component=\"link\" data-source=\"inlineLink\" data-type=\"internalLink\" data-ordinal=\"1\" rel=\"noopener noreferrer\">very hard woods</a>.","layout":"bodyLayout","textStyle":"bodyStyle","format":"html"},{"role":"body","text":"A cast iron base securely mounts to most worktables for a sturdy, stable hold. The included 6.5-inch x 6.5-inch beveling table is small but flexible, allowing you to tilt the drilling surface up to 45 degrees for angled drilling. This drill press has an 8-inch swing and a 2-inch stroke distance, meaning it's not designed to handle large, thick materials. The slots in the table are even large enough to accommodate mounting clamps and vises to secure the drilling surface to the table while tilting.","layout":"bodyLayout","textStyle":"bodyStyle","format":"html"},{"role":"body","text":"When it comes to drilling holes on the go, you probably think of <a href=\"https://www.thespruce.com/how-to-use-a-power-drill-1825112\" data-component=\"link\" data-source=\"inlineLink\" data-type=\"internalLink\" data-ordinal=\"1\">handheld power drills</a>. While these are the go-to choice for hobbyists and professionals alike, most power drills lack the precision some jobs require. When you need an additional guide, a lightweight option like the Ogrmar Drilling Collet Drill Press comes in handy. This ingenious device is far easier to transport than is an actual drill press.","layout":"bodyLayout","textStyle":"bodyStyle","format":"html"},{"role":"body","text":"Instead of forcing you to lug around a dedicated drill press, this tool allows you to secure your existing power drill into a tight, rotating clamp. This clamp holds the drill along the metal rail, giving you the finer degree of precision you need without the extra weight. The clamp rotates from 0 to 90 degrees, so you can even precision drill on vertical surfaces if you can place the press in the correct position.","layout":"bodyLayout","textStyle":"bodyStyle","format":"html"},{"role":"body","text":"A dedicated floor drill press offers the most in terms of professional capability and features. The Delta 18-900L is a top-of-the-line option that maximizes the power, control, and durability you can have out of a drill press. If you have a dedicated workshop or professional projects, this type of drill is an investment that will last you a long time.","layout":"bodyLayout","textStyle":"bodyStyle","format":"html"},{"role":"body","text":"Many professionals prefer floor drills since they don’t take up table space and, in fact, typically offer larger work surfaces underneath the drill. The 18-900L includes a 20 x 28 inch worktable that bevels up to 90 degrees left or right. The 6-inch drill stroke is ideal for industrial applications or projects where larger parts such as 4 x 4 wood beams are common. The extra stroke length means you can drill deeper without having to make additional holes on the other side to connect, and the 18-inch swing lets you tackle even very large materials.","layout":"bodyLayout","textStyle":"bodyStyle","format":"html"},{"role":"body","text":"Drilling through metal is a different experience than working with woods or plastics. Since metal densities vary, you need a drill press that is highly adaptable for different types of metal. The DEWALT DWE1622k Magnetic Drill Press specializes in drilling through steel or similar metals with a two-speed, 10-amp motor and 4-inch drill travel. Its magnetic base lets you position the tool on any ferrous material that's at least 1/2-inch thick. The maximum size bit the tool can accept is 2 inches in diameter.","layout":"bodyLayout","textStyle":"bodyStyle","format":"html"},{"role":"body","text":"The press has overload protection electronics that prevent motor burnout and extend the life of the tool. It includes a coolant tank that you can position as needed while you work. The lower speed setting revs up to 300 rpm, and the higher setting is up to 450 rpm, allowing you to easily penetrate even very hard metals. At 35 pounds, the drill press is fairly heavy, but it’s a sturdy, powerful tool.","layout":"bodyLayout","textStyle":"bodyStyle","format":"html"},{"role":"heading2","text":"What to Look for in a Drill Press","format":"html"},{"role":"heading3","text":"Swing","format":"html"},{"role":"body","text":"The swing of a drill press is the measurement in inches from the chuck—the clamp that holds the bit in place—to the column, which is the thick metal pole supporting the drill press head, multiplied by two. So if the measurement from your drill press’s chuck to column is 5 inches, then the drill press has a 10-inch swing. Swing tells you the largest piece of wood or metal the drill press can accommodate while drilling a hole right in the center. The larger the swing, the larger materials a drill press can handle, so keep this in mind if you regularly work with big pieces of wood or metal.","layout":"bodyLayout","textStyle":"bodyStyle","format":"html"},{"role":"heading3","text":"Stroke Distance","format":"html"},{"role":"body","text":"Also called spindle travel or quill travel, the stroke distance is a measurement of how deep a hole the drill press can create without having to stop and readjust the drill press table or the material being drilled. Smaller or less expensive drill presses often have a mere 2.5-inch stroke distance, sometimes even a little less. Large, heavy-duty floor-standing drill presses can have as much as 6 or more inches of stroke distance, but most hobbyists or general DIYers won’t require this level of performance. As a general rule, around 4 inches of spindle travel is more than sufficient for most typical tasks.","layout":"bodyLayout","textStyle":"bodyStyle","format":"html"},{"role":"heading3","text":"Floor or Benchtop Design","format":"html"},{"role":"body","text":"There are two basic styles of drill press: floor and benchtop.","layout":"bodyLayout","textStyle":"bodyStyle","format":"html"},{"role":"body","text":"As the name suggests, floor drill presses are large tools that stand on the floor. These have a lot of power and typically a swing between 13 and 20 inches. Floor-standing drill presses are best for professional or heavy-duty use.","layout":"bodyLayout","textStyle":"bodyStyle","format":"html"},{"role":"body","text":"Benchtop drill presses sit on a workbench. These smaller machines generally have a swing between 8 and 12 inches, and handle light-to-moderate drilling tasks. Generally, these are the best choice for the average DIYer or hobbyist.","layout":"bodyLayout","textStyle":"bodyStyle","format":"html"},{"role":"heading2","text":"FAQs","format":"html"},{"role":"heading3","text":"What else can you use a drill press for besides drilling holes?","format":"html"},{"role":"body","text":"While the primary use of a drill press is to drill holes—particularly large-bore holes or holes that don’t go all the way through the wood—the tool has other uses, as well. With the right bit or attachment, your drill press can also be used to sand or clean wood and metal, drill square holes, deburr wood or metal, and polish or buff wood or metal surfaces.","layout":"bodyLayout","textStyle":"bodyStyle","format":"html"},{"role":"heading3","text":"Can I use the same bits in my drill press and handheld power drill?","format":"html"},{"role":"body","text":"As a general rule, as long as the shank size of the bit is not larger than your drill press’s chuck—the most common chuck size for a typical benchtop drill press is ½-inch—you can use the same bits with your drill press as you do with your corded or cordless power drill. Drill presses can handle larger diameter bits than the average power drill, however, which is one of the main benefits of these powerful tools.","layout":"bodyLayout","textStyle":"bodyStyle","format":"html"},{"role":"heading3","text":"Is there any way to use a regular drill in place of a drill press?","format":"html"},{"role":"body","text":"If you only need the precision of a drill press for one particular project, you might not want to invest in an entire tool just for that purpose. You can achieve similar results, however, as long as you don’t plan on drilling very large holes or into an exceptionally hard material, by using a frame designed to hold a corded or cordless drill in place as you use it. These frames rotate so you can position the drill just as you need it, and hold it far stiller during use than you’d be able to manage with your hand alone.","layout":"bodyLayout","textStyle":"bodyStyle","format":"html"},{"role":"heading2","text":"Why Trust The Spruce?","format":"html"},{"role":"body","text":"This article was written by <a href=\"https://www.thespruce.com/michelle-ullman-350447\" data-component=\"link\" data-source=\"inlineLink\" data-type=\"internalLink\" data-ordinal=\"1\">Michelle Ullman</a>, the tool expert for The Spruce. She has extensive experience not only in writing about all things related to the home, but also in carrying out various DIY projects, including landscaping, painting, flooring, wallpapering, furniture makeovers, and simple repairs.","layout":"bodyLayout","textStyle":"bodyStyle","format":"html"}],"componentTextStyles":{"authorStyle":{"fontName":"HelveticaNeue-Bold","fontSize":16,"textAlignment":"left","textColor":"#000"},"bodyStyle":{"fontName":"Georgia","fontSize":18,"lineHeight":26,"textAlignment":"left","textColor":"#000"},"default-subtitle":{"fontName":"HelveticaNeue-Thin","fontSize":20,"lineHeight":24,"textAlignment":"center","textColor":"#2F2F2F"},"default-title":{"fontName":"HelveticaNeue-Thin","fontSize":36,"lineHeight":44,"textAlignment":"center","textColor":"#2F2F2F"},"introStyle":{"fontName":"HelveticaNeue-Medium","fontSize":24,"textAlignment":"left","textColor":"#000"},"titleStyle":{"fontName":"HelveticaNeue-Bold","fontSize":64,"lineHeight":74,"textAlignment":"left","textColor":"#000"}},"componentLayouts":{"authorLayout":{"columnSpan":7,"columnStart":0,"margin":{"bottom":15,"top":15}},"bodyLayout":{"columnSpan":5,"columnStart":0,"margin":{"bottom":15,"top":15}},"headerImageLayout":{"columnSpan":7,"columnStart":0,"ignoreDocumentMargin":"true","margin":{"bottom":15,"top":15},"minimumHeight":"40vh"},"introLayout":{"columnSpan":7,"columnStart":0,"margin":{"bottom":15,"top":15}},"titleLayout":{"columnSpan":7,"columnStart":0,"margin":{"bottom":10,"top":50}}}}